Tekla.Structures.ModelInternal.dotHierarchicList_t
Serialization structure for adding and removing relations between model objects and hierarchic objects.

Tekla.Structures.ModelInternal.dotHierarchicList_t.ModelFatherObject
The father (hierarchic) object of this operation

Tekla.Structures.ModelInternal.dotHierarchicList_t.OperationType
Defines if this is an add or delete operation
Tekla.Structures.ModelInternal.dotObjectOperationsEnum

Tekla.Structures.ModelInternal.dotHierarchicList_t.ObjectsLeftToGet
How many objects left to get on next command

Tekla.Structures.ModelInternal.dotHierarchicList_t.nObjects
Number of objects in this struct

Tekla.Structures.ModelInternal.dotHierarchicList_t.aObjects
Object ids